#+TITLE:C Basics
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC100 Introduction to programming in C/C++ Summer 2022
#+DATE: <2022-05-26 Thu>
#+STARTUP: overview hideblocks indent
#+OPTIONS: toc:1 ^:nil
:PROPERTIES:
#+PROPERTY: header-args:C :main yes 
#+PROPERTY: header-args:C :includes <stdio.h>
#+PROPERTY: header-args:C :exports both
#+PROPERTY: header-args:C :results output
#+PROPERTY: header-args:C :comments both
:END:
:REVEAL_PROPERTIES:
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
:END:
** Formatting integer numbers

   * In the code [[intPrint]], ~%d~ is a format specifier for an ~int~:

     #+name: intPrint
     #+begin_src C  
       int height;  // type declaration
       height = 8;  // variable assignment

       printf("The height is: %d\n", height); // formatted printout
     #+end_src

     #+RESULTS: intPrint
     : The height is: 8

** Formatting floating-point numbers

   * In [[floatPrint]], the format specifier ~%f~ is used to print a
     ~float~.

     #+name: floatPrint
     #+begin_src C
       float profit; // type declaration
       profit = 2150.48f; // variable assignment

       printf("The profit is: $%f\n", profit); // formatted printout
     #+end_src

     #+RESULTS: floatPrint
     : The profit is: $2150.479980
     
** Change floating point precision

   - By default, ~%f~ displays the result with six digits after the
     decimal point. To change it to ~p~ digits, put ~.p~ between ~%~ and
     ~f~. E.g. to print it with 2 digits, ~p=2~:

     #+name: digits
     #+begin_src C
       float profit;       // type declaration
       profit = 2150.48f;  // variable assignment

       // formatted printout: 2 digits after decimal point
       printf("The profit is: $%.2f\n", profit); 
     #+end_src

     #+RESULTS: digits
     : The profit is: $2150.48

   - Formatting instructions need to be precise: if you don't specify
     ~p=2~, the computer simply makes digits up! The output below is
     ~$2150.479980~, which can be rounded to the correct result, but it
     is strictly not the same number!

     #+name: digits1
     #+begin_src C
       float profit;       // type declaration
       profit = 2150.48f;  // variable assignment

       printf("The profit is: $%.8f\n", profit); // formatted printout
     #+end_src

     #+RESULTS: digits1
     : The profit is: $2150.47998047

** Formatting errors

   * Bad things happen when you get the formatting wrong.

   * In [[format_test]], we print a ~float~ first correctly, then with the
     wrong format identifier, and then the other way around.

     #+name: format_test
     #+begin_src C :results output
       float foo;  // declare float
       foo = 3.14f;   // assigned float

       // formatting float as float
       printf("float as float: %.2f\n", foo);

       // formating float as int
       printf("float as int: %d\n", foo);

       int bar;  // defined int
       bar = 314;   // assigned int

       // formatting int as int
       printf("int as int: %d\n", bar);

       // formatting int as float
       printf("int as float: %.2f\n", bar);  // int as float
     #+end_src

     #+RESULTS: format_test
     : float as float: 3.14
     : float as int: 1610612736
     : int as int: 314
     : int as float: 3.14

   * When you print an integer as a floating point number or vice
     versa, the results are in general unpredictable!
   
* Putting it all together (extended example)

  * Shipping fees are based on volume instead of weight. For the
    conversion, the volume is divided by 166. If the result exceeds
    the actual weight, the shipping fee is based on the "dimensional
    weight"[fn:11].

  * [ ] We write a program to compute the dimensional ~weight~ of a box of
    given ~volume~ - we use ~/~ for division. Let's say the box is
    12'' x 10'' x 8 ''. What does [[box_error]] need to compile?

    #+name: box_error
    #+begin_example C
      volume = 12 * 10 * 8   // volume = height * width * length
      weight = volume / 166  // dimensional weight
    #+end_example

  * [ ] Fixed the errors in the block [[box]] below. The compiler no
    longer complains, but we don't get any output. How can we print
    the result?

    #+name: box
    #+begin_src C :results silent
      int weight, volume;
      volume = 12 * 10 * 8;
      weight = volume / 166;
    #+end_src

  * [ ] The code in [[box_print]] prints the result of the computation.

    #+name: box_print
    #+begin_src C
      int weight, volume;     // declare variable types
      volume = 12 * 10 * 8;   // compute value
      weight = volume / 166;  // assign and compute values
      printf("The dimensional weight is %d\n",weight); // print result
    #+end_src

    #+RESULTS: box_print
    : The dimensional weight is 5
    
  * This is not what we need. When dividing one integer by another, C
    "truncates" the answer - the result is rounded down, but the
    shipping company wants us to round up. This can be achieved by
    adding 165 to the volume before dividing by 166[fn:12] as shown in
    [[dweight]].

    #+name: dweight
    #+begin_src C
      int weight, volume;     // declare variable types
      volume = 12 * 10 * 8;   // compute value
      weight = (volume + 165) / 166;  // assign and compute values
      printf("The dimensional weight is %d\n",weight); // print result
    #+end_src

    #+RESULTS: dweight
    : The dimensional weight is 6

  * [ ] Now for the final program [[dweight_c]]. 

    #+name: dweight_c
    #+begin_src C :results output
      // declare variable types
      int height, length, width, volume, weight;

      // variable assignments
      height = 8;
      length = 12;
      width = 10;
      volume = height * length * width;
      weight = (volume + 165) / 166;

      // print results
      printf("Dimensions: %dx%dx%d\n", length, width, height);
      printf("Volume (cubic inches): %d\n", volume);
      printf("Dimensional weight (pounds): %d\n", weight);
    #+end_src

    #+RESULTS: dweight_c
    : Dimensions: 12x10x8
    : Volume (cubic inches): 960
    : Dimensional weight (pounds): 6

